os/lab.org
#+TITLE:     Operating Systems --- Lab Instruction
#+AUTHOR:    WANG Xiaolin
#+EMAIL:     wx672ster+os@gmail.com
#+DESCRIPTION: Lab projects for the OS course
#+KEYWORDS: os, operating system, linux, kernel, system call, process, memory, file, gcc, lab, project
#+LANGUAGE:  en
#+OPTIONS:   H:4 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
# (setq org-export-html-use-infojs nil)
# (setq org-export-html-style nil)

* References - noexport                        :noexport:
  - [[http://www.ibm.com/developerworks/linux/library/l-system-calls/][Kernel command using Linux system calls]]
  - [[http://www.ibm.com/developerworks/linux/library/l-proc.html][Access the Linux kernel using the /proc filesystem]]
  - [[http://beej.us/guide/bgipc/output/html/singlepage/bgipc.html][/Beej's Guide to Unix IPC/]], v1.1.2, Brian "Beej Jorgensen" Hall, 2010
  - [[http://cs2.swfu.edu.cn/pub/resources/Books/Linux/WILEY-Beginning_Linux_Programming_Third_Edition.pdf][Beginning Linux Programming]], 3e, N.Matthew, R.Stones, Wiley, 2004

* Caution
  1. To complete the lab work, you have to be happy with 2 foreign languages, =English= and =C=.
  2. Time is short. In the lab, you have no time for both understanding the instruction
     manuals and doing the programing work. So you have to read and understand the lab
     instructions *before* you come to the lab.
  3. Your work (report + source code) must be handed in *within a week after the lab work*.
  4. To start your work, make a directory first, e.g. 20121156001. And then you should do
     everything within this directory. Finally, after you've done, make this directory a
     [[http://www.gnu.org/software/tar/manual/html_chapter/Formats.html#SEC131][=tar-ball=]] and submit it to [[mailto:wx672ster%2Bos@gmail.com][{{{email}}}]]. Besides this tar ball, in your email message
     you *must* tell me:
     1) How many hours you spent in this work?
     2) Your major work in this report;
     3) The major problems you met, and how did you solve (or try solving) them;
     4) Reference books and web links;
  5. These are Linux projects. Your work *must* be done in Linux.
     - You are *required* to finish your report with [[http://orgmode.org/][=Emacs org-mode=]]
       - To enforce the above requirement, you have to submit both an =org file= and a generated
         =html file= as your lab report.
       - A sample [[file:sample-report][report template]] written with Emacs org-mode is provided for your
         reference.
       - You can get some Chinese help about emacs at [[http://emacser.com/][Emacs中文网]].
       - Org-mode Tutorials
     - [[http://orgmode.org/worg/org-tutorials/orgtutorial_dto.php][David O'Toole Org tutorial]]
     - [[http://jaderholm.com/screencasts.html][Org-mode screencast]] ([[http://cs3.swfu.edu.cn/~wx672/org-mode.swf][local copy]])
     - [[http://orgmode.org/worg/org-tutorials/index.php][More org-mode tutorials]]
     - =info org=
       - If you need to draw a picture (e.g. flow chart, etc.), you can use [[http://live.gnome.org/Dia][Dia]], [[http://www.xfig.org/][xfig]], or preferably
         embed an [[http://en.wikipedia.org/wiki/ASCII_art][ascii art]] in your org file.
       - If you need to insert source codes into your org file, you should check:
     - http://orgmode.org/manual/Include-files.html#Include-files, and you can find some
           examples in [[#code-insertion][this section]].
     - MS-word file will *NOT* be accepted!
  6. Late reports will be penalized 20% per day.
  7. Cheating will result in automatic failure of this course.

* Approaching to the Linux kernel
** proc file-system
   - *Reference*
     - [[https://developer.ibm.com/technologies/linux/articles/l-proc/][Access the Linux kernel using the /proc filesystem]] (last visited: [2020-11-20 Fri])
     - =man proc=
     - =ttyplay= [[https://cs6.swfu.edu.cn/~wx672/lecture_notes/os/ttyrec/2.1-ttyrec][=2.1-ttyrec=]] (last visited: [2020-11-20 Fri])
     - =ttyplay= [[https://cs6.swfu.edu.cn/~wx672/lecture_notes/os/ttyrec/submit.ttyrec][=submit.ttyrec=]] (last visited: [2020-11-20 Fri])
   - *Questions*
     1. What's the CPU type and model? (=/proc/cpuinfo=)
     2. What version of the Linux kernel are you using? (=uname=)
     3. How long has it been since your PC last booted? (=uptime=)
     4. How much of the total CPU time has been spent executing in user mode? kernel mode? idle? (=top=)
     5. How much memory is configured in your PC? (=top,free,/proc/meminfo=)
     6. How much memory is currently available? (=top,free,/proc/meminfo=)
     7. How many disk read/write requests have been made? (=/proc/diskstats=)
     8. How many context switches has the kernel performed? (=/proc/stat=)
     9. How many context switches has a process had? (=/proc/[pid]/status=)
     10. How many processes have been created since the system was booted? (=/proc/stat=)
     11. How many processes are there in the ready queue? (=/proc/stat=)
     12. How many processes are blocked waiting for I/O to complete? (=/proc/stat=)
     13. What does the following command do?
     : cd /proc/`ps | head -2 | tail -1 | cut -f1 -d' '` && ls -l
   - *Sum up:* In your email message, please answer the following questions.
     1. How many hours you spent in this section?
     2. What's the major difficulties you met in this section? And,
     3. How did you solve (or try solving) them?
     4. Have you learnt anything? Or your time was just wasted?
