os/lab.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-11-20 Fri 18:26 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Operating Systems &#x2014; Lab Instruction</title>
<meta name="generator" content="Org mode">
<meta name="author" content="WANG Xiaolin">
<meta name="description" content="Lab projects for the OS course"
>
<meta name="keywords" content="os, operating system, linux, kernel, system call, process, memory, file, gcc, lab, project">
<link rel="stylesheet" href="https://cs6.swfu.edu.cn/org.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">Operating Systems &#x2014; Lab Instruction</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org59e708f">1. Caution</a></li>
<li><a href="#orge6a422e">2. Approaching to the Linux kernel</a>
<ul>
<li><a href="#orgfaddff0">2.1. proc file-system</a></li>
<li><a href="#orge18ff3d">2.2. Play with the kernel</a></li>
<li><a href="#org63f086a">2.3. Hello, kernel module!</a>
<ul>
<li><a href="#orgd27040d">2.3.1. Questions</a></li>
<li><a href="#org72e5bbd">2.3.2. Sum up</a></li>
</ul>
</li>
<li><a href="#org85f5184">2.4. System calls</a></li>
</ul>
</li>
<li><a href="#org1e3c265">3. Process Management</a>
<ul>
<li><a href="#code-insertion">3.1. Process creation</a></li>
<li><a href="#orgc3b6738">3.2. Thread</a></li>
<li><a href="#orge15d474">3.3. IPC</a>
<ul>
<li><a href="#orgb3fdfae">3.3.1. Signals</a></li>
<li><a href="#org23bc856">3.3.2. Pipe</a></li>
<li><a href="#orgc15f680">3.3.3. FIFO</a></li>
<li><a href="#org5e4b86c">3.3.4. File Locking</a></li>
<li><a href="#orgd92f434">3.3.5. Message Queues</a></li>
<li><a href="#org9a3d18d">3.3.6. Semaphores</a></li>
<li><a href="#org44c1e2a">3.3.7. Sum up</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8e07e5d">4. Memory management</a>
<ul>
<li><a href="#orgb94d7ce">4.1. Basic commands</a></li>
<li><a href="#orge9c020f">4.2. Shared Memory Segments</a></li>
<li><a href="#orga74e5c7">4.3. Memory Mapped Files</a></li>
<li><a href="#org3f1c303">4.4. Sum up</a></li>
</ul>
</li>
<li><a href="#orgdd7f097">5. File System</a>
<ul>
<li><a href="#orgeeb6735">5.1. File system creation</a>
<ul>
<li><a href="#org0efd8b3">5.1.1. Your tasks</a></li>
</ul>
</li>
<li><a href="#org33e555a">5.2. Finding a file with <code>hexdump</code></a></li>
<li><a href="#org0116497">5.3. Sum up</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org59e708f" class="outline-2">
<h2 id="org59e708f"><span class="section-number-2">1</span> Caution</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>To complete the lab work, you have to be happy with 2 foreign languages, <code>English</code> and <code>C</code>.</li>
<li>Time is short. In the lab, you have no time for both understanding the instruction
manuals and doing the programing work. So you have to read and understand the lab
instructions <b>before</b> you come to the lab.</li>
<li>Your work (report + source code) must be handed in <b>within a week after the lab work</b>.</li>
<li>To start your work, make a directory first, e.g. 20121156001. And then you should do
everything within this directory. Finally, after you've done, make this directory a
<a href="http://www.gnu.org/software/tar/manual/html_chapter/Formats.html#SEC131"><code>tar-ball</code></a> and submit it to <a href="mailto:wx672ster%2Bos@gmail.com">wx672ster+os@gmail.com</a>. Besides this tar ball, in your email message
you <b>must</b> tell me:
<ol class="org-ol">
<li>How many hours you spent in this work?</li>
<li>Your major work in this report;</li>
<li>The major problems you met, and how did you solve (or try solving) them;</li>
<li>Reference books and web links;</li>
</ol></li>
<li>These are Linux projects. Your work <b>must</b> be done in Linux.
<ul class="org-ul">
<li>You are <b>required</b> to finish your report with <a href="http://orgmode.org/"><code>Emacs org-mode</code></a>
<ul class="org-ul">
<li>To enforce the above requirement, you have to submit both an <code>org file</code> and a generated
<code>html file</code> as your lab report.</li>
<li>A sample <a href="sample-report">report template</a> written with Emacs org-mode is provided for your
reference.</li>
<li>You can get some Chinese help about emacs at <a href="http://emacser.com/">Emacs中文网</a>.</li>
<li>Org-mode Tutorials</li>
</ul></li>
<li><a href="http://orgmode.org/worg/org-tutorials/orgtutorial_dto.php">David O'Toole Org tutorial</a></li>
<li><a href="http://jaderholm.com/screencasts.html">Org-mode screencast</a> (<a href="http://cs3.swfu.edu.cn/~wx672/org-mode.swf">local copy</a>)</li>
<li><a href="http://orgmode.org/worg/org-tutorials/index.php">More org-mode tutorials</a></li>
<li><code>info org</code>
<ul class="org-ul">
<li>If you need to draw a picture (e.g. flow chart, etc.), you can use <a href="http://live.gnome.org/Dia">Dia</a>, <a href="http://www.xfig.org/">xfig</a>, or preferably
embed an <a href="http://en.wikipedia.org/wiki/ASCII_art">ascii art</a> in your org file.</li>
<li>If you need to insert source codes into your org file, you should check:</li>
</ul></li>
<li><a href="http://orgmode.org/manual/Include-files.html#Include-files">http://orgmode.org/manual/Include-files.html#Include-files</a>, and you can find some
examples in <a href="#code-insertion">this section</a>.</li>
<li>MS-word file will <b>NOT</b> be accepted!</li>
</ul></li>
<li>Late reports will be penalized 20% per day.</li>
<li>Cheating will result in automatic failure of this course.</li>
</ol>
</div>
</div>

<div id="outline-container-orge6a422e" class="outline-2">
<h2 id="orge6a422e"><span class="section-number-2">2</span> Approaching to the Linux kernel</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgfaddff0" class="outline-3">
<h3 id="orgfaddff0"><span class="section-number-3">2.1</span> proc file-system</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><b>Reference</b>
<ul class="org-ul">
<li><a href="https://developer.ibm.com/technologies/linux/articles/l-proc/">Access the Linux kernel using the /proc filesystem</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
<li><code>man proc</code></li>
<li><code>ttyplay</code> <a href="https://cs6.swfu.edu.cn/~wx672/lecture_notes/os/ttyrec/2.1-ttyrec"><code>2.1-ttyrec</code></a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
<li><code>ttyplay</code> <a href="https://cs6.swfu.edu.cn/~wx672/lecture_notes/os/ttyrec/submit.ttyrec"><code>submit.ttyrec</code></a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
</ul></li>
<li><p>
<b>Questions</b>
</p>
<ol class="org-ol">
<li>What's the CPU type and model? (<code>/proc/cpuinfo</code>)</li>
<li>What version of the Linux kernel are you using? (<code>uname</code>)</li>
<li>How long has it been since your PC last booted? (<code>uptime</code>)</li>
<li>How much of the total CPU time has been spent executing in user mode? kernel mode? idle? (<code>top</code>)</li>
<li>How much memory is configured in your PC? (<code>top,free,/proc/meminfo</code>)</li>
<li>How much memory is currently available? (<code>top,free,/proc/meminfo</code>)</li>
<li>How many disk read/write requests have been made? (<code>/proc/diskstats</code>)</li>
<li>How many context switches has the kernel performed? (<code>/proc/stat</code>)</li>
<li>How many context switches has a process had? (<code>/proc/[pid]/status</code>)</li>
<li>How many processes have been created since the system was booted? (<code>/proc/stat</code>)</li>
<li>How many processes are there in the ready queue? (<code>/proc/stat</code>)</li>
<li>How many processes are blocked waiting for I/O to complete? (<code>/proc/stat</code>)</li>
<li>What does the following command do?</li>
</ol>
<pre class="example">
cd /proc/`ps | head -2 | tail -1 | cut -f1 -d' '` &amp;&amp; ls -l
</pre></li>
<li><b>Sum up:</b> In your email message, please answer the following questions.
<ol class="org-ol">
<li>How many hours you spent in this section?</li>
<li>What's the major difficulties you met in this section? And,</li>
<li>How did you solve (or try solving) them?</li>
<li>Have you learnt anything? Or your time was just wasted?</li>
</ol></li>
</ul>
</div>
</div>
