os/lab.org
** Play with the kernel
   - *Help for beginners*
     - /Debian Linux Kernel Handbook/, 2012. (Chapter 4, [[https://kernel-team.pages.debian.net/kernel-handbook/ch-common-tasks.html][/Common kernel-related tasks/]])  (last visited: [2020-11-20 Fri])
       : sudo apt install debian-kernel-handbook
     - Kroah-Hartman, Greg. [[http://www.kroah.com/lkn/][/Linux Kernel in a Nutshell: A Desktop Quick Reference/]],
       O'Reilly, 2007.  (last visited: [2020-11-20 Fri])
       - [[https://cs6.swfu.edu.cn/calibre/get/PDF/46/calibre][cs6 calibre]]
     - R. Love. [[https://cs6.swfu.edu.cn/calibre/get/PDF/12/calibre][/Linux Kernel Development/]]. Developer’s
       Library. Addison-Wesley, 2010. (Chapter 2, /Getting start with the kernel/)  (last visited: [2020-11-20 Fri])
     - [[http://www.win.tue.nl/~aeb/linux/lk/lk.html#toc2][/The Linux kernel/]], Andries Brouwer, 2003. (Chapter 2, [[http://www.win.tue.nl/~aeb/linux/lk/lk-2.html][/The Kernel Source/]])  (last visited: [2020-11-20 Fri])
   - *How to get around in the source code tree?* The kernel source is in
        =/usr/src/= directory if you installed it with =sudo apt install linux-source=. There are several ways to browse this huge repository:
     1. [[https://elixir.bootlin.com/linux/latest/source][https://elixir.bootlin.com]] (last visited: [2020-11-20 Fri])
     2. global (=man global=)
     3. cscope (=man cscope=)
     4. ctags (=man ctags=)
     5. =find + grep + less=
   - *Your Task:* (The objective of this task is to get an idea about where and how to view
     the Linux source code. You are *NOT* required to understand the code at this moment.)
     1. Find the following "famous" code, and tell me why they are "famous".
        - =start_kernel();=
        - =init();=
        - =struct task_struct;=
        - =struct inode;=
        - =struct file;=
        - =fork();=
        - =include/asm-generic/unistd.h=
        - =arch/x86_64/entry.S=
        - =kernel/printk.c=
     2. Finish lesson 2-6 of [[https://courses.linuxchix.org/kernel-hacking-2002.html][LinuxChix Kernel Hacking Lessons]] (last visited: [2020-11-20 Fri]). And you are
        encouraged to go through lesson 7-9, though it's not mandatory.
   - *Sum up:* In your email message, please answer the following questions.
     1. How many hours you spent in this section?
     2. What's the major difficulties you met in this section? And,
     3. How did you solve (or try solving) them?
     4. Have you learnt anything? Or your time was just wasted?

** Hello, kernel module!
   - *Reference* 
     - [[http://tldp.org/LDP/lkmpg/2.6/html/lkmpg.html#AEN119][The Linux Kernel Module Programming Guide]], 2007.  (last visited: [2020-11-20 Fri])
     - [[https://developer.ibm.com/technologies/linux/articles/l-proc/][Access the Linux kernel using the /proc filesystem]], 2006.  (last visited: [2020-11-20 Fri])
     - [[https://cs6.swfu.edu.cn/~wx672/lecture_notes/linux/c/c_dev.html#sec-6][A =Makefile= tutorial]], 2013. (last visited: [2020-11-20 Fri])
   - *Quick start*
     1) Find out the right kernel headers package matching your running kernel:
        : uname -a
        : aptitude search ^linux-headers
        install the right headers-package matching your running kernel:
        : sudo aptitude install linux-headers-`uname -r`
     2) Make a directory to store your =Hello, world!= kernel module
        : mkdir hello-lkm && cd hello-lkm
     3) In =hello-lkm= directory, write a [[file:src/hello-lkm/hello-1.c][hello-1.c]]. (See [[http://tldp.org/LDP/lkmpg/2.6/html/lkmpg.html#AEN119][The Linux Kernel Module
        Programming Guide]] chapter 2 for details.)  (last visited: [2020-11-20 Fri])
     4) Write a [[file:src/hello-lkm/Makefile][Makefile]]
     5) make
        : make
        If everything is ok, there should be a =hello-1.ko= file in your =hello-lkm= directory.
     6) Install the module into the running kernel
        : sudo insmod hello-1.ko
     7) See if it's running
        : lsmod | grep hello
        Does it show up? Well, and you can see "Hello, world!" here:
        : dmesg | tail
     8) Now, you can remove this useless module from the kernel by doing:
        : sudo rmmod hello_1
     9) See if it's removed:
        : lsmod | grep hello
        And you should see "Goodbye, world!" here:
        : dmesg | tail
*** Questions
    1. What's a kernel module?
    2. How do modules get into the kernel?
    3. How do you know a kernel module is loaded?
    4. How do you know a module is working properly or not?
    5. How do you unload a module?
*** Sum up
    In your email message, please answer the following questions.
     1. How many hours you spent in this section?
     2. What's the major problems you met in this section? And,
     3. How did you solve (or try solving) them?
     4. Have you learnt anything? Or your time was just wasted?
** System calls
   - *Reference*
     - Google /linux system call tutorial/.
   - *Your task:* Follow whatever tutorial you found to write your own a system call. 
   - *Sum up:* In your email message, please answer the following questions.
     1. How many hours you spent in this section?
     2. What's the major problems you met in this section? And,
     3. How did you solve (or try solving) them?
     4. Have you learnt anything? Or your time was just wasted?
* Process Management
  - *Reference*
    - [[http://www.yolinux.com/TUTORIALS/ForkExecProcesses.html][Fork, Exec and Process control]] (last visited: [2020-11-20 Fri])
    - [[http://www.yolinux.com/TUTORIALS/LinuxTutorialPosixThreads.html][POSIX thread (pthread) libraries]] (last visited: [2020-11-20 Fri])
  - *Command line* 
    Get a sense of the following commands:
    1. =ps=
       : ps -af
       : ps -ax
       : ps -eLf
    2. =pstree=
    3. =nice/renice=
    4. =top=
       : man top
       Process Status:
       - =D=: uninterruptible sleep
       - =R=: running
       - =S=: sleeping
       - =T=: traced or stopped
       - =Z=: zombie
