os/lab.html
<div id="outline-container-orge18ff3d" class="outline-3">
<h3 id="orge18ff3d"><span class="section-number-3">2.2</span> Play with the kernel</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><b>Help for beginners</b>
<ul class="org-ul">
<li><p>
<i>Debian Linux Kernel Handbook</i>, 2012. (Chapter 4, <a href="https://kernel-team.pages.debian.net/kernel-handbook/ch-common-tasks.html"><i>Common kernel-related tasks</i></a>)  (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)
</p>
<pre class="example">
sudo apt install debian-kernel-handbook
</pre></li>
<li>Kroah-Hartman, Greg. <a href="http://www.kroah.com/lkn/"><i>Linux Kernel in a Nutshell: A Desktop Quick Reference</i></a>,
O'Reilly, 2007.  (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)
<ul class="org-ul">
<li><a href="https://cs6.swfu.edu.cn/calibre/get/PDF/46/calibre">cs6 calibre</a></li>
</ul></li>
<li>R. Love. <a href="https://cs6.swfu.edu.cn/calibre/get/PDF/12/calibre"><i>Linux Kernel Development</i></a>. Developer’s
Library. Addison-Wesley, 2010. (Chapter 2, <i>Getting start with the kernel</i>)  (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
<li><a href="http://www.win.tue.nl/~aeb/linux/lk/lk.html#toc2"><i>The Linux kernel</i></a>, Andries Brouwer, 2003. (Chapter 2, <a href="http://www.win.tue.nl/~aeb/linux/lk/lk-2.html"><i>The Kernel Source</i></a>)  (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
</ul></li>
<li><b>How to get around in the source code tree?</b> The kernel source is in
<code>/usr/src/</code> directory if you installed it with <code>sudo apt install linux-source</code>. There are several ways to browse this huge repository:
<ol class="org-ol">
<li><a href="https://elixir.bootlin.com/linux/latest/source">https://elixir.bootlin.com</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
<li>global (<code>man global</code>)</li>
<li>cscope (<code>man cscope</code>)</li>
<li>ctags (<code>man ctags</code>)</li>
<li><code>find + grep + less</code></li>
</ol></li>
<li><b>Your Task:</b> (The objective of this task is to get an idea about where and how to view
the Linux source code. You are <b>NOT</b> required to understand the code at this moment.)
<ol class="org-ol">
<li>Find the following "famous" code, and tell me why they are "famous".
<ul class="org-ul">
<li><code>start_kernel();</code></li>
<li><code>init();</code></li>
<li><code>struct task_struct;</code></li>
<li><code>struct inode;</code></li>
<li><code>struct file;</code></li>
<li><code>fork();</code></li>
<li><code>include/asm-generic/unistd.h</code></li>
<li><code>arch/x86_64/entry.S</code></li>
<li><code>kernel/printk.c</code></li>
</ul></li>
<li>Finish lesson 2-6 of <a href="https://courses.linuxchix.org/kernel-hacking-2002.html">LinuxChix Kernel Hacking Lessons</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>). And you are
encouraged to go through lesson 7-9, though it's not mandatory.</li>
</ol></li>
<li><b>Sum up:</b> In your email message, please answer the following questions.
<ol class="org-ol">
<li>How many hours you spent in this section?</li>
<li>What's the major difficulties you met in this section? And,</li>
<li>How did you solve (or try solving) them?</li>
<li>Have you learnt anything? Or your time was just wasted?</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-org63f086a" class="outline-3">
<h3 id="org63f086a"><span class="section-number-3">2.3</span> Hello, kernel module!</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><b>Reference</b> 
<ul class="org-ul">
<li><a href="http://tldp.org/LDP/lkmpg/2.6/html/lkmpg.html#AEN119">The Linux Kernel Module Programming Guide</a>, 2007.  (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
<li><a href="https://developer.ibm.com/technologies/linux/articles/l-proc/">Access the Linux kernel using the /proc filesystem</a>, 2006.  (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
<li><a href="https://cs6.swfu.edu.cn/~wx672/lecture_notes/linux/c/c_dev.html#sec-6">A <code>Makefile</code> tutorial</a>, 2013. (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
</ul></li>
<li><b>Quick start</b>
<ol class="org-ol">
<li><p>
Find out the right kernel headers package matching your running kernel:
</p>
<pre class="example">
uname -a
aptitude search ^linux-headers
</pre>

<p>
install the right headers-package matching your running kernel:
</p>
<pre class="example">
sudo aptitude install linux-headers-`uname -r`
</pre></li>
<li><p>
Make a directory to store your <code>Hello, world!</code> kernel module
</p>
<pre class="example">
mkdir hello-lkm &amp;&amp; cd hello-lkm
</pre></li>
<li>In <code>hello-lkm</code> directory, write a <a href="src/hello-lkm/hello-1.c">hello-1.c</a>. (See <a href="http://tldp.org/LDP/lkmpg/2.6/html/lkmpg.html#AEN119">The Linux Kernel Module
Programming Guide</a> chapter 2 for details.)  (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
<li>Write a <a href="src/hello-lkm/Makefile">Makefile</a></li>
<li><p>
make
</p>
<pre class="example">
make
</pre>

<p>
If everything is ok, there should be a <code>hello-1.ko</code> file in your <code>hello-lkm</code> directory.
</p></li>
<li><p>
Install the module into the running kernel
</p>
<pre class="example">
sudo insmod hello-1.ko
</pre></li>
<li><p>
See if it's running
</p>
<pre class="example">
lsmod | grep hello
</pre>

<p>
Does it show up? Well, and you can see "Hello, world!" here:
</p>
<pre class="example">
dmesg | tail
</pre></li>
<li><p>
Now, you can remove this useless module from the kernel by doing:
</p>
<pre class="example">
sudo rmmod hello_1
</pre></li>
<li><p>
See if it's removed:
</p>
<pre class="example">
lsmod | grep hello
</pre>

<p>
And you should see "Goodbye, world!" here:
</p>
<pre class="example">
dmesg | tail
</pre></li>
</ol></li>
</ul>
</div>
<div id="outline-container-orgd27040d" class="outline-4">
<h4 id="orgd27040d"><span class="section-number-4">2.3.1</span> Questions</h4>
<div class="outline-text-4" id="text-2-3-1">
<ol class="org-ol">
<li>What's a kernel module?</li>
<li>How do modules get into the kernel?</li>
<li>How do you know a kernel module is loaded?</li>
<li>How do you know a module is working properly or not?</li>
<li>How do you unload a module?</li>
</ol>
</div>
</div>
<div id="outline-container-org72e5bbd" class="outline-4">
<h4 id="org72e5bbd"><span class="section-number-4">2.3.2</span> Sum up</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
In your email message, please answer the following questions.
</p>
<ol class="org-ol">
<li>How many hours you spent in this section?</li>
<li>What's the major problems you met in this section? And,</li>
<li>How did you solve (or try solving) them?</li>
<li>Have you learnt anything? Or your time was just wasted?</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org85f5184" class="outline-3">
<h3 id="org85f5184"><span class="section-number-3">2.4</span> System calls</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><b>Reference</b>
<ul class="org-ul">
<li>Google <i>linux system call tutorial</i>.</li>
</ul></li>
<li><b>Your task:</b> Follow whatever tutorial you found to write your own a system call.</li>
<li><b>Sum up:</b> In your email message, please answer the following questions.
<ol class="org-ol">
<li>How many hours you spent in this section?</li>
<li>What's the major problems you met in this section? And,</li>
<li>How did you solve (or try solving) them?</li>
<li>Have you learnt anything? Or your time was just wasted?</li>
</ol></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1e3c265" class="outline-2">
<h2 id="org1e3c265"><span class="section-number-2">3</span> Process Management</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><b>Reference</b>
<ul class="org-ul">
<li><a href="http://www.yolinux.com/TUTORIALS/ForkExecProcesses.html">Fork, Exec and Process control</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
<li><a href="http://www.yolinux.com/TUTORIALS/LinuxTutorialPosixThreads.html">POSIX thread (pthread) libraries</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
</ul></li>
<li><b>Command line</b> 
Get a sense of the following commands:
<ol class="org-ol">
<li><p>
<code>ps</code>
</p>
<pre class="example">
ps -af
ps -ax
ps -eLf
</pre></li>
<li><code>pstree</code></li>
<li><code>nice/renice</code></li>
<li><p>
<code>top</code>
</p>
<pre class="example">
man top
</pre>

<p>
Process Status:
</p>
<ul class="org-ul">
<li><code>D</code>: uninterruptible sleep</li>
<li><code>R</code>: running</li>
<li><code>S</code>: sleeping</li>
<li><code>T</code>: traced or stopped</li>
<li><code>Z</code>: zombie</li>
</ul></li>
</ol></li>
</ul>
</div>
