os/lab.org
** Process creation
   :PROPERTIES:
   :CUSTOM_ID: code-insertion
   :END:
   - *Reference* 
     - =man fork=
     - =man exec=
     - =man wait=
     - =man exit=
     - =man 2 kill=
   - *Your tasks*
     1. There is an example c program at the end of the =wait= manual page (=man
        wait=). Read it, compile it, and run it. Then answer the following questions:
        1. Both =exit()= and =_exit()= are used in the program. What's the difference?
        2. Tell me about the following line of code:
           : w = waitpid(cpid, &status, WUNTRACED | WCONTINUED);
     2. =system()=, =fork()=, =exec()=
 
        Compile and run the following 4 programs. Tell me what they do? And [[http://stackoverflow.com/questions/1697440/difference-between-system-and-exec-in-linux][their differences]] (last visited: [2020-11-20 Fri])?
        #+BEGIN_SRC c
        #include <stdlib.h>
        #include <stdio.h>
        int main()
        {
            printf("Running ps with system\n");
            system("ps -ax &");
            printf("Done.\n");
            exit(0);
        }
        #+END_SRC
        #+BEGIN_SRC c
        #include <unistd.h>
        #include <stdio.h>
        int main()
        {
            printf("Running ps with execlp\n");
            execlp("ps", "ps", "-ax", 0);
            printf("Done.\n");
            exit(0);
        }
        #+END_SRC
        #+BEGIN_SRC c
        #include <stdio.h>
        #include <unistd.h>
        int main(){
        
           pid_t child_p;
           printf("Running ps with fork\n");
        
           child_p = fork();
        
           execlp("ps", "ps", "-ax", 0);
           return 0;
        }
        #+END_SRC
        #+BEGIN_SRC c
        #include <unistd.h>
        #include <stdio.h>
        int main()
        {
            pid_t pid;
            printf("Running ps again with fork\n");
            pid = fork();
            if ( pid == 0 ) { // in the child, do exec
            execlp("ps", "ps", "-ax", 0);
            }
            else if (pid < 0) // failed to fork
            {
                printf("fork failed.\n");
                exit(1);
            }
            else // parent
            {
            wait(NULL);
            }
            exit(0);
        }
        #+END_SRC
     3. more on =fork()= and =wait()= 

        Compile and run [[./src/proc/fork-blp.c][this program]]. Tell me why the output is weird (mixed with
        the =$= prompt)? And fix it with the =wait()= system call.
     4. zombies and =waitpid()=
        - Read the *NOTES* section in the =wait= manual page (=man 2 wait=) to get a clear
          idea about zombie processes. And tell me why zombie is not welcomed.
        - At the end of =wait= manual page (=man 2 wait=), there is an example
          program. Play with it, and tell me about =WUNTRACED=, =WCONTINUED=, =WIFEXITED=,
          =WEXITSTATUS=, =WIFSIGNALED=, =WTERMSIG=, =WIFSTOPPED=, =WSTOPSIG=,
          =WIFCONTINUED=, =pause()=.
        - Compile and run [[./src/proc/zombie.c][this small program]]. This program can leave a [[http://en.wikipedia.org/wiki/Zombie_process][zombie process]]
          in the system. You can see it with
          : ps u
      - *Your task:*
        - Write a similar program that leaves 5 zombies.
        - Tell me what's the difference between a [[http://en.wikipedia.org/wiki/Zombie_process][zombie process]] and a [[http://en.wikipedia.org/wiki/Orphan_process][orphan process]]?
        - Read [[https://cs6.swfu.edu.cn/calibre/get/PDF/39/calibre][Beginning Linux Programming]] (last visited: [2020-11-20 Fri]), Chapter 11, page 503 to learn how to avoid
              zombies with =waitpid()= system call. And correct the above program.
        - Tell me the difference between =exit()= and =return=.
   - *Sum up:*  In your email message, please answer the following questions.
     1. How many hours you spent in this section?
     2. What's the major problems you met in this section? And,
     3. How did you solve (or try solving) them?
     4. Have you learnt anything? Or your time was just wasted?
** Thread
   - *Reference* 
     - =man 3 pthread_create=
     - =man 3 pthread_attr_init=
   - *Tasks*
     1. At the end of =pthread_create= manual page (=man 3 pthread_create=), there is an example
        program. Play with it, and then tell me:
        1. What's the =tinfo[]=?
        2. What's the =res=?
     2. At the end of =pthread_attr_init= manual page (=man 3 pthread_attr_init=), there is an
        example program. Compile and run it.
     3. Compile and run [[./src/proc/thread2.c][this program]]. Now, remove the =pthread_join= call, i.e. comment
        out line 29-32. Compile and run it again for multiple times. Tell me the
        difference, and why?
   - *Sum up:* In your email message, please answer the following questions.
     1. How many hours you spent in this section?
     2. What's the major difficulties you met in this section? And,
     3. How did you solve (or try solving) them?
     4. Have you learnt anything? Or your time was just wasted?

** IPC
   - *Reference:* 
     [[http://beej.us/guide/bgipc/][/Beej's Guide to Unix IPC/]] (last visited: [2020-11-20 Fri])
