os/lab.html
<div id="outline-container-code-insertion" class="outline-3">
<h3 id="code-insertion"><span class="section-number-3">3.1</span> Process creation</h3>
<div class="outline-text-3" id="text-code-insertion">
<ul class="org-ul">
<li><b>Reference</b> 
<ul class="org-ul">
<li><code>man fork</code></li>
<li><code>man exec</code></li>
<li><code>man wait</code></li>
<li><code>man exit</code></li>
<li><code>man 2 kill</code></li>
</ul></li>
<li><b>Your tasks</b>
<ol class="org-ol">
<li>There is an example c program at the end of the <code>wait</code> manual page (<code>man
        wait</code>). Read it, compile it, and run it. Then answer the following questions:
<ol class="org-ol">
<li>Both <code>exit()</code> and <code>_exit()</code> are used in the program. What's the difference?</li>
<li><p>
Tell me about the following line of code:
</p>
<pre class="example">
w = waitpid(cpid, &amp;status, WUNTRACED | WCONTINUED);
</pre></li>
</ol></li>
<li><p>
<code>system()</code>, <code>fork()</code>, <code>exec()</code>
</p>

<p>
Compile and run the following 4 programs. Tell me what they do? And <a href="http://stackoverflow.com/questions/1697440/difference-between-system-and-exec-in-linux">their differences</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)?
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #FFA000;">#include</span> <span style="color: #689f38;">&lt;stdlib.h&gt;</span>
<span style="color: #FFA000;">#include</span> <span style="color: #689f38;">&lt;stdio.h&gt;</span>
<span style="color: #0097A7;">int</span> <span style="color: #0097A7;">main</span>()
{
    printf(<span style="color: #689f38;">"Running ps with system\n"</span>);
    system(<span style="color: #689f38;">"ps -ax &amp;"</span>);
    printf(<span style="color: #689f38;">"Done.\n"</span>);
    exit(0);
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #FFA000;">#include</span> <span style="color: #689f38;">&lt;unistd.h&gt;</span>
<span style="color: #FFA000;">#include</span> <span style="color: #689f38;">&lt;stdio.h&gt;</span>
<span style="color: #0097A7;">int</span> <span style="color: #0097A7;">main</span>()
{
    printf(<span style="color: #689f38;">"Running ps with execlp\n"</span>);
    execlp(<span style="color: #689f38;">"ps"</span>, <span style="color: #689f38;">"ps"</span>, <span style="color: #689f38;">"-ax"</span>, 0);
    printf(<span style="color: #689f38;">"Done.\n"</span>);
    exit(0);
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #FFA000;">#include</span> <span style="color: #689f38;">&lt;stdio.h&gt;</span>
<span style="color: #FFA000;">#include</span> <span style="color: #689f38;">&lt;unistd.h&gt;</span>
<span style="color: #0097A7;">int</span> <span style="color: #0097A7;">main</span>(){

   <span style="color: #0097A7;">pid_t</span> <span style="color: #EF6C00;">child_p</span>;
   printf(<span style="color: #689f38;">"Running ps with fork\n"</span>);

   child_p = fork();

   execlp(<span style="color: #689f38;">"ps"</span>, <span style="color: #689f38;">"ps"</span>, <span style="color: #689f38;">"-ax"</span>, 0);
   <span style="color: #00796b;">return</span> 0;
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #FFA000;">#include</span> <span style="color: #689f38;">&lt;unistd.h&gt;</span>
<span style="color: #FFA000;">#include</span> <span style="color: #689f38;">&lt;stdio.h&gt;</span>
<span style="color: #0097A7;">int</span> <span style="color: #0097A7;">main</span>()
{
    <span style="color: #0097A7;">pid_t</span> <span style="color: #EF6C00;">pid</span>;
    printf(<span style="color: #689f38;">"Running ps again with fork\n"</span>);
    pid = fork();
    <span style="color: #00796b;">if</span> ( pid == 0 ) { <span style="color: #607d8b;">// </span><span style="color: #607d8b;">in the child, do exec</span>
    execlp(<span style="color: #689f38;">"ps"</span>, <span style="color: #689f38;">"ps"</span>, <span style="color: #689f38;">"-ax"</span>, 0);
    }
    <span style="color: #00796b;">else</span> <span style="color: #00796b;">if</span> (pid &lt; 0) <span style="color: #607d8b;">// </span><span style="color: #607d8b;">failed to fork</span>
    {
        printf(<span style="color: #689f38;">"fork failed.\n"</span>);
        exit(1);
    }
    <span style="color: #00796b;">else</span> <span style="color: #607d8b;">// </span><span style="color: #607d8b;">parent</span>
    {
    wait(<span style="color: #558b2f;">NULL</span>);
    }
    exit(0);
}
</pre>
</div></li>
<li><p>
more on <code>fork()</code> and <code>wait()</code> 
</p>

<p>
Compile and run <a href="./src/proc/fork-blp.c">this program</a>. Tell me why the output is weird (mixed with
the <code>$</code> prompt)? And fix it with the <code>wait()</code> system call.
</p></li>
<li><p>
zombies and <code>waitpid()</code>
</p>
<ul class="org-ul">
<li>Read the <b>NOTES</b> section in the <code>wait</code> manual page (<code>man 2 wait</code>) to get a clear
idea about zombie processes. And tell me why zombie is not welcomed.</li>
<li>At the end of <code>wait</code> manual page (<code>man 2 wait</code>), there is an example
program. Play with it, and tell me about <code>WUNTRACED</code>, <code>WCONTINUED</code>, <code>WIFEXITED</code>,
<code>WEXITSTATUS</code>, <code>WIFSIGNALED</code>, <code>WTERMSIG</code>, <code>WIFSTOPPED</code>, <code>WSTOPSIG</code>,
<code>WIFCONTINUED</code>, <code>pause()</code>.</li>
<li><p>
Compile and run <a href="./src/proc/zombie.c">this small program</a>. This program can leave a <a href="http://en.wikipedia.org/wiki/Zombie_process">zombie process</a>
in the system. You can see it with
</p>
<pre class="example">
ps u
</pre></li>
</ul>
<ul class="org-ul">
<li><b>Your task:</b>
<ul class="org-ul">
<li>Write a similar program that leaves 5 zombies.</li>
<li>Tell me what's the difference between a <a href="http://en.wikipedia.org/wiki/Zombie_process">zombie process</a> and a <a href="http://en.wikipedia.org/wiki/Orphan_process">orphan process</a>?</li>
<li>Read <a href="https://cs6.swfu.edu.cn/calibre/get/PDF/39/calibre">Beginning Linux Programming</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>), Chapter 11, page 503 to learn how to avoid
zombies with <code>waitpid()</code> system call. And correct the above program.</li>
<li>Tell me the difference between <code>exit()</code> and <code>return</code>.</li>
</ul></li>
</ul></li>
</ol></li>
<li><b>Sum up:</b>  In your email message, please answer the following questions.
<ol class="org-ol">
<li>How many hours you spent in this section?</li>
<li>What's the major problems you met in this section? And,</li>
<li>How did you solve (or try solving) them?</li>
<li>Have you learnt anything? Or your time was just wasted?</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-orgc3b6738" class="outline-3">
<h3 id="orgc3b6738"><span class="section-number-3">3.2</span> Thread</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><b>Reference</b> 
<ul class="org-ul">
<li><code>man 3 pthread_create</code></li>
<li><code>man 3 pthread_attr_init</code></li>
</ul></li>
<li><b>Tasks</b>
<ol class="org-ol">
<li>At the end of <code>pthread_create</code> manual page (<code>man 3 pthread_create</code>), there is an example
program. Play with it, and then tell me:
<ol class="org-ol">
<li>What's the <code>tinfo[]</code>?</li>
<li>What's the <code>res</code>?</li>
</ol></li>
<li>At the end of <code>pthread_attr_init</code> manual page (<code>man 3 pthread_attr_init</code>), there is an
example program. Compile and run it.</li>
<li>Compile and run <a href="./src/proc/thread2.c">this program</a>. Now, remove the <code>pthread_join</code> call, i.e. comment
out line 29-32. Compile and run it again for multiple times. Tell me the
difference, and why?</li>
</ol></li>
<li><b>Sum up:</b> In your email message, please answer the following questions.
<ol class="org-ol">
<li>How many hours you spent in this section?</li>
<li>What's the major difficulties you met in this section? And,</li>
<li>How did you solve (or try solving) them?</li>
<li>Have you learnt anything? Or your time was just wasted?</li>
</ol></li>
</ul>
</div>
</div>
