os/lab.org
*** Signals
    - *Reference*
      - /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/signals.html][section 3]]
      - [[file:/usr/src/linux/include/asm-generic/signal.h][signal.h]]
      - [[http://bytes.com/topic/c/answers/220198-how-understand-function-prototype-signal][How to understand function prototype signal()]] (last visited: [2020-11-20 Fri])
      - [[http://www.newty.de/fpt/intro.html][The Function Pointer Tutorials]] (last visited: [2020-11-20 Fri])
      - [[http://en.wikipedia.org/wiki/Typedef][typedef]] (last visited: [2020-11-20 Fri])
      - =man 2 signal=, =man 7 signal=
      - =man sigaction=
      - =kill, killall=
    - *Tasks*
      1. understanding =signal()=
     
         If you can understand
         
         #+begin_src c
         typedef int MYINT;
         MYINT myfunction(MYINT);
         #+end_src
         
         Then, you should be able to understand

         #+begin_src c
         typedef void (*sighandler_t)(int);
         sighandler_t signal(int signum, sighandler_t handler);
         #+end_src
         
         Now, tell me your understanding about the following [[http://en.wikipedia.org/wiki/Function_prototype][function prototype]]:
         
         #+begin_example
         void (*signal(int sig, void (*func)(int)))(int);
                      `-------------------v------------'
                                           `----> *signal() is a function returning a 'function pointer'
                                            `               pointing to a function of type void(*)(int)
                                             `--> *signal() takes 2 arguments:
                                                    .  sig - an int
                                                    . func - a 'function pointer' void(*)(int)
         #+end_example

         Put it in another way:

         #+begin_example
         void (*signal(int sig, void (*func)(int)))(int);
         void (                 *                 )(int);
         `--------------------v------------------------'
                               `---> void(*)(int) is a function pointer which is:
                                     - returned by function '*signal()'
                                     - pointing to a function taking an int, returning void
         #+end_example

         - =man 2 signal= can help

      2. Following /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/signals.html][section 3]] to play with signals. And then
         tell me details about the following code
         : int sigaction(int signum, const struct sigaction *act, struct sigaction *oldact);
         - =man 2 sigaction= can help

*** Pipe
    - *Reference*
      - /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/pipes.html][section 4]]
      - =man pipe=
      - =man 2 write=
      - =man 2 read=
    - *Tasks*
      1. Follow /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/pipes.html][section 4]] step by step to learn how to use =pipe=.
      2. Modify [[http://beej.us/guide/bgipc/examples/pipe3.c][pipe3.c]] in /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/pipes.html][section 4]] to make the child does the =wc -l=, and the parent does the =ls=.
      3. At the end of =pipe= manual page (=man 2 pipe=), there is an example program. Compile it, run it, understand it, and then, modify the program, let parent do read, and child do write.
*** FIFO
    - *Reference*
      - /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/fifos.html][section 5]]
      - =man fifo=
      - =man mkfifo=
      - =man 3 mkfifo=
      - =man mknod=
      - =man 2 mknod=
    - *Tasks*
      1. Follow /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/output/html/singlepage/bgipc.html#fifos][section 5]] step by step to learn how to use FIFOs.
      2. When you run the example programs (=speak= and =tick=), there should be a new file named =american_maid= appear in your working directory (=$PWD=). What will happen if you delete this FIFO file while the two programs running? Why?
      3. Modify the example programs to use =mkfifo= instead of =mknod=.
      4. Extend the example programs, and make it have 3 writers.
*** File Locking
    - *Reference*
      - /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/flocking.html][section 6]]
      - =man flock=
      - =man 2 flock=
      - =man fcntl=
      - =include/asm-generic/fcntl.h=
    - *Tasks*
      1. Follow /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/flocking.html][section 6]] step by step to learn how to use File locks.
      2. Try the example =lockdemo.c= with both =F_RDLCK= and =F_WRLCK=.
      3. Tell me whether the locked file, e.g. =lockdemo.c= can be delete while the programs are running? And why?

*** Message Queues
    - *Reference*
      - /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/mq.html][section 7]]
      - =man ipcs=
      - =man ipcrm=
      - =man ipcmk=
      - =man msgget=
      - =man ftok=
      - =man msgsnd=, =man msgrcv=
      - =man msgctl=
      - =man offsetof=
      - =include/linux/msg.h=
    - *Tasks*
      1. Follow /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/mq.html][section 7]] step by step to learn how to use message queues.
      2. What happens when you're running both in separate windows and you kill one or the other?
      3. Also try running two copies of =kirk= or two copies of =spock= to get an idea of what
         happens when you have two readers or two writers.
      4. Another interesting demonstration is to run kirk, enter a bunch of messages, then run spock
         and see it retrieve all the messages in one swoop. Just messing around with these toy
         programs will help you gain an understanding of what is really going on.
      5. What happens if you =ipcrm= the queue while it's in use? Why?
      6. Create a message queue with =ipcmk=, and use it in your programs.
