os/lab.html

<div id="outline-container-orge15d474" class="outline-3">
<h3 id="orge15d474"><span class="section-number-3">3.3</span> IPC</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><b>Reference:</b> 
<a href="http://beej.us/guide/bgipc/"><i>Beej's Guide to Unix IPC</i></a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
</ul>
</div>
<div id="outline-container-orgb3fdfae" class="outline-4">
<h4 id="orgb3fdfae"><span class="section-number-4">3.3.1</span> Signals</h4>
<div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li><b>Reference</b>
<ul class="org-ul">
<li><i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/signals.html">section 3</a></li>
<li><a href="file:///usr/src/linux/include/asm-generic/signal.h">signal.h</a></li>
<li><a href="http://bytes.com/topic/c/answers/220198-how-understand-function-prototype-signal">How to understand function prototype signal()</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
<li><a href="http://www.newty.de/fpt/intro.html">The Function Pointer Tutorials</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
<li><a href="http://en.wikipedia.org/wiki/Typedef">typedef</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
<li><code>man 2 signal</code>, <code>man 7 signal</code></li>
<li><code>man sigaction</code></li>
<li><code>kill, killall</code></li>
</ul></li>
<li><b>Tasks</b>
<ol class="org-ol">
<li><p>
understanding <code>signal()</code>
</p>

<p>
If you can understand
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #00796b;">typedef</span> <span style="color: #0097A7;">int</span> <span style="color: #0097A7;">MYINT</span>;
<span style="color: #0097A7;">MYINT</span> <span style="color: #0097A7;">myfunction</span>(<span style="color: #0097A7;">MYINT</span>);
</pre>
</div>

<p>
Then, you should be able to understand
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #00796b;">typedef</span> <span style="color: #0097A7;">void</span> (*<span style="color: #0097A7;">sighandler_t</span>)(<span style="color: #0097A7;">int</span>);
<span style="color: #0097A7;">sighandler_t</span> <span style="color: #0097A7;">signal</span>(<span style="color: #0097A7;">int</span> <span style="color: #EF6C00;">signum</span>, <span style="color: #0097A7;">sighandler_t</span> <span style="color: #EF6C00;">handler</span>);
</pre>
</div>

<p>
Now, tell me your understanding about the following <a href="http://en.wikipedia.org/wiki/Function_prototype">function prototype</a>:
</p>

<pre class="example" id="orgc8ed6b8">
void (*signal(int sig, void (*func)(int)))(int);
             `-------------------v------------'
                                  `----&gt; *signal() is a function returning a 'function pointer'
                                   `               pointing to a function of type void(*)(int)
                                    `--&gt; *signal() takes 2 arguments:
                                           .  sig - an int
                                           . func - a 'function pointer' void(*)(int)
</pre>

<p>
Put it in another way:
</p>

<pre class="example" id="org11e0725">
void (*signal(int sig, void (*func)(int)))(int);
void (                 *                 )(int);
`--------------------v------------------------'
                      `---&gt; void(*)(int) is a function pointer which is:
                            - returned by function '*signal()'
                            - pointing to a function taking an int, returning void
</pre>

<ul class="org-ul">
<li><code>man 2 signal</code> can help</li>
</ul></li>

<li><p>
Following <i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/signals.html">section 3</a> to play with signals. And then
tell me details about the following code
</p>
<pre class="example">
int sigaction(int signum, const struct sigaction *act, struct sigaction *oldact);
</pre>

<ul class="org-ul">
<li><code>man 2 sigaction</code> can help</li>
</ul></li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-org23bc856" class="outline-4">
<h4 id="org23bc856"><span class="section-number-4">3.3.2</span> Pipe</h4>
<div class="outline-text-4" id="text-3-3-2">
<ul class="org-ul">
<li><b>Reference</b>
<ul class="org-ul">
<li><i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/pipes.html">section 4</a></li>
<li><code>man pipe</code></li>
<li><code>man 2 write</code></li>
<li><code>man 2 read</code></li>
</ul></li>
<li><b>Tasks</b>
<ol class="org-ol">
<li>Follow <i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/pipes.html">section 4</a> step by step to learn how to use <code>pipe</code>.</li>
<li>Modify <a href="http://beej.us/guide/bgipc/examples/pipe3.c">pipe3.c</a> in <i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/pipes.html">section 4</a> to make the child does the <code>wc -l</code>, and the parent does the <code>ls</code>.</li>
<li>At the end of <code>pipe</code> manual page (<code>man 2 pipe</code>), there is an example program. Compile it, run it, understand it, and then, modify the program, let parent do read, and child do write.</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-orgc15f680" class="outline-4">
<h4 id="orgc15f680"><span class="section-number-4">3.3.3</span> FIFO</h4>
<div class="outline-text-4" id="text-3-3-3">
<ul class="org-ul">
<li><b>Reference</b>
<ul class="org-ul">
<li><i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/fifos.html">section 5</a></li>
<li><code>man fifo</code></li>
<li><code>man mkfifo</code></li>
<li><code>man 3 mkfifo</code></li>
<li><code>man mknod</code></li>
<li><code>man 2 mknod</code></li>
</ul></li>
<li><b>Tasks</b>
<ol class="org-ol">
<li>Follow <i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/output/html/singlepage/bgipc.html#fifos">section 5</a> step by step to learn how to use FIFOs.</li>
<li>When you run the example programs (<code>speak</code> and <code>tick</code>), there should be a new file named <code>american_maid</code> appear in your working directory (<code>$PWD</code>). What will happen if you delete this FIFO file while the two programs running? Why?</li>
<li>Modify the example programs to use <code>mkfifo</code> instead of <code>mknod</code>.</li>
<li>Extend the example programs, and make it have 3 writers.</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-org5e4b86c" class="outline-4">
<h4 id="org5e4b86c"><span class="section-number-4">3.3.4</span> File Locking</h4>
<div class="outline-text-4" id="text-3-3-4">
<ul class="org-ul">
<li><b>Reference</b>
<ul class="org-ul">
<li><i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/flocking.html">section 6</a></li>
<li><code>man flock</code></li>
<li><code>man 2 flock</code></li>
<li><code>man fcntl</code></li>
<li><code>include/asm-generic/fcntl.h</code></li>
</ul></li>
<li><b>Tasks</b>
<ol class="org-ol">
<li>Follow <i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/flocking.html">section 6</a> step by step to learn how to use File locks.</li>
<li>Try the example <code>lockdemo.c</code> with both <code>F_RDLCK</code> and <code>F_WRLCK</code>.</li>
<li>Tell me whether the locked file, e.g. <code>lockdemo.c</code> can be delete while the programs are running? And why?</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-orgd92f434" class="outline-4">
<h4 id="orgd92f434"><span class="section-number-4">3.3.5</span> Message Queues</h4>
<div class="outline-text-4" id="text-3-3-5">
<ul class="org-ul">
<li><b>Reference</b>
<ul class="org-ul">
<li><i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/mq.html">section 7</a></li>
<li><code>man ipcs</code></li>
<li><code>man ipcrm</code></li>
<li><code>man ipcmk</code></li>
<li><code>man msgget</code></li>
<li><code>man ftok</code></li>
<li><code>man msgsnd</code>, <code>man msgrcv</code></li>
<li><code>man msgctl</code></li>
<li><code>man offsetof</code></li>
<li><code>include/linux/msg.h</code></li>
</ul></li>
<li><b>Tasks</b>
<ol class="org-ol">
<li>Follow <i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/mq.html">section 7</a> step by step to learn how to use message queues.</li>
<li>What happens when you're running both in separate windows and you kill one or the other?</li>
<li>Also try running two copies of <code>kirk</code> or two copies of <code>spock</code> to get an idea of what
happens when you have two readers or two writers.</li>
<li>Another interesting demonstration is to run kirk, enter a bunch of messages, then run spock
and see it retrieve all the messages in one swoop. Just messing around with these toy
programs will help you gain an understanding of what is really going on.</li>
<li>What happens if you <code>ipcrm</code> the queue while it's in use? Why?</li>
<li>Create a message queue with <code>ipcmk</code>, and use it in your programs.</li>
</ol></li>
</ul>
</div>
</div>
