os/lab.org
*** Semaphores
    - *Reference*
      - /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/semaphores.html][section 8]]
      - =include/linux/sem.h=
      - =man semget=
      - =man semop=
      - =man semctl=
    - *Tasks*
      1. Follow /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/semaphores.html][section 8]] step by step to learn how to use semaphores.
      2. Semaphores are used to lock some shared resources to enforce mutual-exclusion. In the demo program =semdemo.c=, what's locked?
      3. Draw a flow chart to show how the demo program works.

*** CANCELLED Unix Sockets               :noexport:CANCELLED:
    CLOSED: [2010-09-06 Mon 23:38]
    :LOGBOOK:
    - State "CANCELLED"  from "TODO"       [2010-09-06 Mon 23:39]
    :END:
**** Reference
     - /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/output/html/singlepage/bgipc.html#unixsock][section 11]] ([[http://cs2.swfu.edu.cn/pub/resources/Books/OS/webcourses/beej.us/guide/bgipc/output/html/singlepage/bgipc.html#unixsock][cs2 mirror]])
*** Sum up
    In your email message, please answer the following questions.
     1. How many hours you spent in this section?
     2. What's the major difficulties you met in this section? And,
     3. How did you solve (or try solving) them?
     4. Have you learnt anything? Or your time was just wasted?

* Memory management
  - *Reference*
    [[https://www.informit.com/articles/article.aspx?p=173438][User-Level Memory Management in Linux Programming]], 2004. (last visited: [2020-11-20 Fri])
** Basic commands
   1. top
      : top
      With the help of =man top=, get a clear idea about:
      - VIRT :: Virtual Image (kb)

        The total amount of virtual memory used by the task. It includes all
        code, data and shared libraries plus pages that have been swapped out.

        VIRT = SWAP + RES

      - SWAP :: Swapped size (kb)

        The swapped out portion of a task's total virtual memory image.

      - RES :: Resident size (kb). (=ps -aly=).

           The non-swapped physical memory a task has used.

           RES = CODE + DATA

      - CODE :: Code size (kb)

        The amount of physical memory devoted to executable code, also
        known as the 'text resident set' size or TRS.

      - DATA :: Data+Stack size (kb)

        The amount of physical memory devoted to other than executable
        code, also known as the 'data resident set' size or DRS.

      - SHR :: Shared Mem size (kb)

           The amount of shared memory used by a task. It simply reflects
           memory that could be potentially shared with other processes.

      - nFLT :: Page Fault count

        The number of major page faults that have occurred for a task.  A page fault occurs
        when a process attempts to read from or write to a virtual page that is not
        currently present in its address space.  A major page fault is when backing storage
        access (such as a disk) is involved in making that page available.

      - nDRT :: Dirty Pages count

        The number of pages that have been modified since they were last written to disk.
        Dirty pages must be written to disk before the corresponding physical memory
        location can be used for some other virtual page.

   2. =size=, =objdump=, =nm=

      Compile [[./src/mem/size.c][this c program]] with
      : gcc -Wall size.c
      Then, use =size= to see the size of its /text/, /data/, and /bss/ segments.
      : size a.out
      The output should be something like
      : text   data   bss        dec         hex    filename
      : 1200   520    1024032    1025752     fa6d8      a.out
      If you exam its size with =ls -l=, you should get something similar to the following
      line
      : -rwxr-xr-x   1 wx672          wx672        6627 Oct 18 18:05 a.out
      Tell me:
      1. What does the =6627= mean?
      2. What do the =1200=, =520=, =1024032=, and =1025752= mean?
** Shared Memory Segments
   - *Reference* 
     - /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/shm.html][section 9]].
     - =man shmget=
     - =man shmat=
     - =man shmdt=
     - =man shmctl=
     - =man ipcrm=
     - =man ipcs=
   - *Your tasks*
     1. Follow /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/shm.html][section 9]] step by step to learn how to use shared memory segments.
     2. Use =ipcrm= to remove the segment you just created while running the example code.
     3. Add semaphore mechanism into the sample program (=shmdemo.c=) to enforce mutual-exclusive
        access to the shared data area.

** Memory Mapped Files
   - *Reference* 
     - /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/mmap.html][section 10]].
     - =man fseek=
     - =man mmap=, =man munmap=
     - =man getpagesize=
     - =man stat=
   - *Your tasks*
     1. Follow /Beej's Guide to Unix IPC/, [[http://beej.us/guide/bgipc/html/multi/mmap.html][section 10]] step by step to learn how to use memory mapped files.
     2. Write a small program to find out the page size of your Linux PC.
     3. Add semaphore mechanism into the sample program (=mmapdemo.c=) to enforce mutual-exclusive
        access to the shared data area.
** Sum up
   In your email message, please answer the following questions.
     1. How many hours you spent in this section?
     2. What's the major difficulties you met in this section? And,
     3. How did you solve (or try solving) them?
     4. Have you learnt anything? Or your time was just wasted?
    
* File System 
  - *Reference*
    - [[https://cs6.swfu.edu.cn/~wx672/lecture_notes/os/ext2-analysis.html][Ext2 file system analysis]] (last visited: [2020-11-20 Fri])
    - [[http://www.nongnu.org/ext2-doc/ext2.html][Ext2 documentation]] (last visited: [2020-11-20 Fri])
    - [[https://developer.ibm.com/technologies/systems/tutorials/l-linux-filesystem/][Anatomy of the Linux file system]] (last visited: [2020-11-20 Fri])
    - [[http://www.haifux.org/lectures/119/linux-2.4-vfs/index.html][The VFS (Virtual File System) in Linux Kernel V2.4 --- A Play In 5 Acts]] (last visited: [2020-11-20 Fri])
