os/lab.html
<div id="outline-container-org9a3d18d" class="outline-4">
<h4 id="org9a3d18d"><span class="section-number-4">3.3.6</span> Semaphores</h4>
<div class="outline-text-4" id="text-3-3-6">
<ul class="org-ul">
<li><b>Reference</b>
<ul class="org-ul">
<li><i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/semaphores.html">section 8</a></li>
<li><code>include/linux/sem.h</code></li>
<li><code>man semget</code></li>
<li><code>man semop</code></li>
<li><code>man semctl</code></li>
</ul></li>
<li><b>Tasks</b>
<ol class="org-ol">
<li>Follow <i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/semaphores.html">section 8</a> step by step to learn how to use semaphores.</li>
<li>Semaphores are used to lock some shared resources to enforce mutual-exclusion. In the demo program <code>semdemo.c</code>, what's locked?</li>
<li>Draw a flow chart to show how the demo program works.</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-org44c1e2a" class="outline-4">
<h4 id="org44c1e2a"><span class="section-number-4">3.3.7</span> Sum up</h4>
<div class="outline-text-4" id="text-3-3-7">
<p>
In your email message, please answer the following questions.
</p>
<ol class="org-ol">
<li>How many hours you spent in this section?</li>
<li>What's the major difficulties you met in this section? And,</li>
<li>How did you solve (or try solving) them?</li>
<li>Have you learnt anything? Or your time was just wasted?</li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-org8e07e5d" class="outline-2">
<h2 id="org8e07e5d"><span class="section-number-2">4</span> Memory management</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><b>Reference</b>
<a href="https://www.informit.com/articles/article.aspx?p=173438">User-Level Memory Management in Linux Programming</a>, 2004. (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
</ul>
</div>
<div id="outline-container-orgb94d7ce" class="outline-3">
<h3 id="orgb94d7ce"><span class="section-number-3">4.1</span> Basic commands</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li><p>
top
</p>
<pre class="example">
top
</pre>

<p>
With the help of <code>man top</code>, get a clear idea about:
</p>
<dl class="org-dl">
<dt>VIRT</dt><dd><p>
Virtual Image (kb)
</p>

<p>
The total amount of virtual memory used by the task. It includes all
code, data and shared libraries plus pages that have been swapped out.
</p>

<p>
VIRT = SWAP + RES
</p></dd>

<dt>SWAP</dt><dd><p>
Swapped size (kb)
</p>

<p>
The swapped out portion of a task's total virtual memory image.
</p></dd>

<dt>RES</dt><dd><p>
Resident size (kb). (<code>ps -aly</code>).
</p>

<p>
The non-swapped physical memory a task has used.
</p>

<p>
RES = CODE + DATA
</p></dd>

<dt>CODE</dt><dd><p>
Code size (kb)
</p>

<p>
The amount of physical memory devoted to executable code, also
known as the 'text resident set' size or TRS.
</p></dd>

<dt>DATA</dt><dd><p>
Data+Stack size (kb)
</p>

<p>
The amount of physical memory devoted to other than executable
code, also known as the 'data resident set' size or DRS.
</p></dd>

<dt>SHR</dt><dd><p>
Shared Mem size (kb)
</p>

<p>
The amount of shared memory used by a task. It simply reflects
memory that could be potentially shared with other processes.
</p></dd>

<dt>nFLT</dt><dd><p>
Page Fault count
</p>

<p>
The number of major page faults that have occurred for a task.  A page fault occurs
when a process attempts to read from or write to a virtual page that is not
currently present in its address space.  A major page fault is when backing storage
access (such as a disk) is involved in making that page available.
</p></dd>

<dt>nDRT</dt><dd><p>
Dirty Pages count
</p>

<p>
The number of pages that have been modified since they were last written to disk.
Dirty pages must be written to disk before the corresponding physical memory
location can be used for some other virtual page.
</p></dd>
</dl></li>

<li><p>
<code>size</code>, <code>objdump</code>, <code>nm</code>
</p>

<p>
Compile <a href="./src/mem/size.c">this c program</a> with
</p>
<pre class="example">
gcc -Wall size.c
</pre>

<p>
Then, use <code>size</code> to see the size of its <i>text</i>, <i>data</i>, and <i>bss</i> segments.
</p>
<pre class="example">
size a.out
</pre>

<p>
The output should be something like
</p>
<pre class="example">
text   data   bss        dec         hex    filename
1200   520    1024032    1025752     fa6d8      a.out
</pre>

<p>
If you exam its size with <code>ls -l</code>, you should get something similar to the following
line
</p>
<pre class="example">
-rwxr-xr-x   1 wx672          wx672        6627 Oct 18 18:05 a.out
</pre>

<p>
Tell me:
</p>
<ol class="org-ol">
<li>What does the <code>6627</code> mean?</li>
<li>What do the <code>1200</code>, <code>520</code>, <code>1024032</code>, and <code>1025752</code> mean?</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-orge9c020f" class="outline-3">
<h3 id="orge9c020f"><span class="section-number-3">4.2</span> Shared Memory Segments</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li><b>Reference</b> 
<ul class="org-ul">
<li><i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/shm.html">section 9</a>.</li>
<li><code>man shmget</code></li>
<li><code>man shmat</code></li>
<li><code>man shmdt</code></li>
<li><code>man shmctl</code></li>
<li><code>man ipcrm</code></li>
<li><code>man ipcs</code></li>
</ul></li>
<li><b>Your tasks</b>
<ol class="org-ol">
<li>Follow <i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/shm.html">section 9</a> step by step to learn how to use shared memory segments.</li>
<li>Use <code>ipcrm</code> to remove the segment you just created while running the example code.</li>
<li>Add semaphore mechanism into the sample program (<code>shmdemo.c</code>) to enforce mutual-exclusive
access to the shared data area.</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-orga74e5c7" class="outline-3">
<h3 id="orga74e5c7"><span class="section-number-3">4.3</span> Memory Mapped Files</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li><b>Reference</b> 
<ul class="org-ul">
<li><i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/mmap.html">section 10</a>.</li>
<li><code>man fseek</code></li>
<li><code>man mmap</code>, <code>man munmap</code></li>
<li><code>man getpagesize</code></li>
<li><code>man stat</code></li>
</ul></li>
<li><b>Your tasks</b>
<ol class="org-ol">
<li>Follow <i>Beej's Guide to Unix IPC</i>, <a href="http://beej.us/guide/bgipc/html/multi/mmap.html">section 10</a> step by step to learn how to use memory mapped files.</li>
<li>Write a small program to find out the page size of your Linux PC.</li>
<li>Add semaphore mechanism into the sample program (<code>mmapdemo.c</code>) to enforce mutual-exclusive
access to the shared data area.</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-org3f1c303" class="outline-3">
<h3 id="org3f1c303"><span class="section-number-3">4.4</span> Sum up</h3>
<div class="outline-text-3" id="text-4-4">
<p>
In your email message, please answer the following questions.
</p>
<ol class="org-ol">
<li>How many hours you spent in this section?</li>
<li>What's the major difficulties you met in this section? And,</li>
<li>How did you solve (or try solving) them?</li>
<li>Have you learnt anything? Or your time was just wasted?</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgdd7f097" class="outline-2">
<h2 id="orgdd7f097"><span class="section-number-2">5</span> File System</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><b>Reference</b>
<ul class="org-ul">
<li><a href="https://cs6.swfu.edu.cn/~wx672/lecture_notes/os/ext2-analysis.html">Ext2 file system analysis</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
<li><a href="http://www.nongnu.org/ext2-doc/ext2.html">Ext2 documentation</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
<li><a href="https://developer.ibm.com/technologies/systems/tutorials/l-linux-filesystem/">Anatomy of the Linux file system</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
<li><a href="http://www.haifux.org/lectures/119/linux-2.4-vfs/index.html">The VFS (Virtual File System) in Linux Kernel V2.4 &#x2014; A Play In 5 Acts</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)</li>
</ul></li>
</ul>
</div>
