os/lab.org
** File system creation
   1. Create a initialized file
      : dd if=/dev/zero of=fs.img bs=1k count=10000
      You now have a file called =fs.img= that's 10MB.
   2. Use the =losetup= command to associate a loop device with the file (making it look
      like a block device instead of just a regular file within the file system):
      : sudo losetup /dev/loop0 fs.img
   3. Creating an ext2 file system within the loop device
      : sudo mke2fs /dev/loop0 
   4. Mount the newly created file system onto =/mnt= directory
      : sudo mount -t ext2 /dev/loop0 /mnt
      or
      : sudo mount -o loop fs.img /mnt
   5. Get information about your new file system   
      : dumpe2fs /dev/loop0
*** Your tasks
    1. By following the above 5 steps, you've got a new file system mounted on =/mnt=
       directory. Now you can get into =/mnt=, and create a new file in it. And then
       associate it with a loop device (=/dev/loop1=), and create another file system in
       it.
    2. Plug your USB disk into your PC's USB port, and check 
       1. what file system it is?
       2. which directory it's mounted on?
       3. Use =fsck= to get some details about your USB disk.
** Finding a file with =hexdump=
   Follow the instructions in
   [[https://cs6.swfu.edu.cn/~wx672/lecture_notes/os/ext2-analysis.html#sec-3]] (last visited: [2020-11-20 Fri])
   to learn how to find a file with =hexdump= in your newly created file system.
   And then answer this question:
   - After you do '=cat hello=' at the command line, you will see on the screen the
     content of file =hello=, in our case it is '=helloworld='.
     
     Now give me a detailed picture about what is happened in the OS from '=cat hello=' to
     '=helloworld=' is shown on the screen.
** Sum up
   In your email message, please answer the following questions.
     1. How many hours you spent in this section?
     2. What's the major difficulties you met in this section? And,
     3. How did you solve (or try solving) them?
     4. Have you learnt anything? Or your time was just wasted?
