os/lab.html
<div id="outline-container-orgeeb6735" class="outline-3">
<h3 id="orgeeb6735"><span class="section-number-3">5.1</span> File system creation</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li><p>
Create a initialized file
</p>
<pre class="example">
dd if=/dev/zero of=fs.img bs=1k count=10000
</pre>

<p>
You now have a file called <code>fs.img</code> that's 10MB.
</p></li>
<li><p>
Use the <code>losetup</code> command to associate a loop device with the file (making it look
like a block device instead of just a regular file within the file system):
</p>
<pre class="example">
sudo losetup /dev/loop0 fs.img
</pre></li>
<li><p>
Creating an ext2 file system within the loop device
</p>
<pre class="example">
sudo mke2fs /dev/loop0 
</pre></li>
<li><p>
Mount the newly created file system onto <code>/mnt</code> directory
</p>
<pre class="example">
sudo mount -t ext2 /dev/loop0 /mnt
</pre>

<p>
or
</p>
<pre class="example">
sudo mount -o loop fs.img /mnt
</pre></li>
<li><p>
Get information about your new file system   
</p>
<pre class="example">
dumpe2fs /dev/loop0
</pre></li>
</ol>
</div>
<div id="outline-container-org0efd8b3" class="outline-4">
<h4 id="org0efd8b3"><span class="section-number-4">5.1.1</span> Your tasks</h4>
<div class="outline-text-4" id="text-5-1-1">
<ol class="org-ol">
<li>By following the above 5 steps, you've got a new file system mounted on <code>/mnt</code>
directory. Now you can get into <code>/mnt</code>, and create a new file in it. And then
associate it with a loop device (<code>/dev/loop1</code>), and create another file system in
it.</li>
<li>Plug your USB disk into your PC's USB port, and check 
<ol class="org-ol">
<li>what file system it is?</li>
<li>which directory it's mounted on?</li>
<li>Use <code>fsck</code> to get some details about your USB disk.</li>
</ol></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org33e555a" class="outline-3">
<h3 id="org33e555a"><span class="section-number-3">5.2</span> Finding a file with <code>hexdump</code></h3>
<div class="outline-text-3" id="text-5-2">
<p>
Follow the instructions in
<a href="https://cs6.swfu.edu.cn/~wx672/lecture_notes/os/ext2-analysis.html#sec-3">https://cs6.swfu.edu.cn/~wx672/lecture_notes/os/ext2-analysis.html#sec-3</a> (last visited: <span class="timestamp-wrapper"><span class="timestamp">[2020-11-20 Fri]</span></span>)
to learn how to find a file with <code>hexdump</code> in your newly created file system.
And then answer this question:
</p>
<ul class="org-ul">
<li><p>
After you do '<code>cat hello</code>' at the command line, you will see on the screen the
content of file <code>hello</code>, in our case it is '<code>helloworld</code>'.
</p>

<p>
Now give me a detailed picture about what is happened in the OS from '<code>cat hello</code>' to
'<code>helloworld</code>' is shown on the screen.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org0116497" class="outline-3">
<h3 id="org0116497"><span class="section-number-3">5.3</span> Sum up</h3>
<div class="outline-text-3" id="text-5-3">
<p>
In your email message, please answer the following questions.
</p>
<ol class="org-ol">
<li>How many hours you spent in this section?</li>
<li>What's the major difficulties you met in this section? And,</li>
<li>How did you solve (or try solving) them?</li>
<li>Have you learnt anything? Or your time was just wasted?</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: WANG Xiaolin</p>
<p class="date">Created: 2020-11-20 Fri 18:26</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
